#!python
#coding=utf-8
# 参考：https://xinlixue.cn/wb/archives/bigfive.html
# 使用方法：先使用excel进行240道题目的回答，并将自测分数保存在txt文件中。
# 然后运行这个python程序，对自测分数进行分析
# notice：
#   1、分数仅供参考
#   2、excel的题目中，部分题目序号可能与下面的人格方向题型的积分索引不兼容，
#      因此要获得更准确的评分，可以使用另一份txt文件中的题目，先计算各个维度的分数，然后使用这个程序进行分数的归一化与打分
# update 2024-7-21 对原先的Excel表进行了检查，并修改了部分题目的表述；同时对计分参考做了检查，对本程序进行了修改，目前Excel的题目和本程序是一致的。
# 其他参考：
# https://zhuanlan.zhihu.com/p/128735685
# https://max.book118.com/html/2018/1207/5230240144001334.shtm
# 2023-4-15

import numpy as np
import sys

def pre_calc(s):
    # s = [] 
    # 存储自评分数的数组。
    # 请注意，我们以题号对自评分数进行索引，因此下标0的位置应该置空

    ## 各人格方向计分

    N = np.arange(6) ## 神经质
    # N1-焦虑
    N[0] = (4-s[1])+s[31]+(4-s[61])+s[91]+(4-s[121])+s[151]+(4-s[181])+s[211]
    # N2-愤怒敌意
    N[1] = s[6]+(4-s[36])+s[66]+(4-s[96])+s[126]+(4-s[156])+s[186]+s[216]
    # N3-抑郁
    N[2] = (4-s[11])+s[41]+(4-s[71])+s[101]+s[131]+s[161]+s[191]+s[221]
    # N4-自我意识（人际敏感）
    N[3] = s[16]+(4-s[46])+s[76]+(4-s[106])+s[136]+(4-s[166])+s[196]+s[226]
    # N5-冲动性
    N[4] = (4-s[21])+s[51]+(4-s[81])+s[111]+(4-s[141])+s[171]+s[201]+(4-s[231])
    # N6-脆弱性
    N[5] = s[26]+(4-s[56])+s[86]+(4-s[116])+s[146]+(4-s[176])+(4-s[206])+(4-s[236])

    E = np.arange(6) ## 外向性
    # E1-热情性
    E[0] = s[2]+(4-s[32])+s[62]+(4-s[92])+s[122]+s[152]+s[182]+s[212]
    # E2-乐群性
    E[1] = (4-s[7])+s[37]+(4-s[67])+s[97]+(4-s[127])+s[157]+(4-s[187])+s[217]
    # E3-自我肯定
    E[2] = s[12]+(4-s[42])+s[72]+(4-s[102])+s[132]+s[162]+s[192]+(4-s[222])
    # E4-活跃性
    E[3] = (4-s[17])+s[47]+(4-s[77])+s[107]+(4-s[137])+s[167]+s[197]+s[227]
    # E5-寻求刺激
    E[4] = s[22]+(4-s[52])+s[82]+(4-s[112])+s[142]+s[172]+s[202]+s[232]
    # E6-积极（正性）情感
    E[5] = (4-s[27])+s[57]+(4-s[87])+s[117]+(4-s[147])+s[177]+(4-s[207])+s[237]

    O = np.arange(6) ## 开放性
    # O1-想象力
    O[0] = s[3]+(4-s[33])+s[63]+(4-s[93])+s[123]+(4-s[153])+(4-s[183])+(4-s[213])
    # O2-艺术美感
    O[1] = s[8]+s[38]+(4-s[68])+s[98]+(4-s[128])+s[158]+s[188]+s[218]
    # O3-情绪体验性
    O[2] = s[13]+(4-s[43])+s[73]+(4-s[103])+s[133]+(4-s[163])+s[193]+s[223]
    # O4-行动（言行灵活开发度）
    O[3] = (4-s[18])+s[48]+(4-s[78])+s[108]+(4-s[138])+s[168]+(4-s[198])+(4-s[228])
    # O5-观念（观念灵活开放度）
    O[4] = s[23]+(4-s[53])+s[83]+(4-s[113])+s[143]+(4-s[173])+s[203]+s[233]
    # O6-价值（人生、社会价值开放度）
    O[5] = (4-s[28])+s[58]+(4-s[88])+s[118]+(4-s[148])+s[178]+(4-s[208])+(4-s[238])

    A = np.arange(6) ## 顺从性
    # A1-人际信任
    A[0] = (4-s[4])+s[34]+(4-s[64])+s[94]+(4-s[124])+s[154]+s[184]+s[214]
    # A2-坦诚（正直性）
    A[1] = s[9]+(4-s[39])+s[69]+(4-s[99])+s[129]+(4-s[159])+(4-s[189])+(4-s[219])
    # A3-利他性
    A[2] = (4-s[14])+s[44]+(4-s[74])+s[104]+(4-s[134])+s[164]+s[194]+s[224]
    # A4-顺从性（合作顺从）
    A[3] = s[19]+(4-s[49])+s[79]+(4-s[109])+s[139]+(4-s[169])+(4-s[199])+(4-s[229])
    # A5-谦虚
    A[4] = (4-s[24])+s[54]+(4-s[84])+s[114]+(4-s[144])+s[174]+s[204]+(4-s[234])
    # A6-温存（人际关怀）
    A[5] = s[29]+(4-s[59])+s[89]+(4-s[119])+s[149]+s[179]+s[209]+s[239]

    C = np.arange(6) ## 严谨性
    # C1-胜任感
    C[0] = s[5]+(4-s[35])+s[65]+(4-s[95])+s[125]+(4-s[155])+s[185]+s[215]
    # C2-计划条理性
    C[1] = s[10]+s[40]+(4-s[70])+s[100]+(4-s[130])+s[160]+(4-s[190])+(4-s[220])
    # C3-责任感
    C[2] = s[15]+(4-s[45])+s[75]+(4-s[105])+s[135]+s[165]+s[195]+s[225]
    # C4-事业心（成就/上进心）
    C[3] = (4-s[20])+s[50]+(4-s[80])+s[110]+(4-s[140])+s[170]+s[200]+s[230]
    # C5-自律性
    C[4] = s[25]+(4-s[55])+s[85]+(4-s[115])+s[145]+(4-s[175])+(4-s[205])+s[235]
    # C6-审慎性
    C[5] = (4-s[30])+s[60]+(4-s[90])+s[120]+(4-s[150])+s[180]+s[210]+s[240]

    return [N,E,O,A,C]


## 常模（归一化参数）
# 男性
norm_m = [
        #[平均分,       标准差, 维度代码,       维度]
        [83.78, 24.41,  'n',    '敏感性'],
        [109.96,        18.27,  'e',    '外向性'],
        [110.64,        15.88,  'o',    '开放性'],
        [113,   14.9,   'a',    '宜人性'],
        [123.88,        20.32,  'c',    '严谨性'],
        [14.15, 5.7,    'n1',   '焦虑'],
        [13.82, 5.24,   'n2',   '愤怒敌意'],
        [14.37, 5.7,    'n3',   '抑郁'],
        [15.35, 4.73,   'n4',   '自我意识'],
        [14.86, 4.88,   'n5',   '冲动性'],
        [11.23, 5.09,   'n6',   '脆弱性'],
        [21.53, 4.27,   'e1',   '热情性'],
        [18.69, 4.65,   'e2',   '乐群性'],
        [15.1,  4.37,   'e3',   '自我肯定'],
        [18.33, 4.74,   'e4',   '活跃性'],
        [17.24, 4.64,   'e5',   '刺激追寻'],
        [19.07, 4.85,   'e6',   '正性情绪'],
        [15.19, 4.19,   'o1',   '幻想'],
        [20.7,  4.88,   'o2',   '美感'],
        [19.47, 3.95,   'o3',   '情感'],
        [15.02, 3.61,   'o4',   '行动'],
        [19.62, 4.98,   'o5',   '观念'],
        [20.64, 3.97,   'o6',   '价值'],
        [21.07, 3.94,   'a1',   '信任'],
        [19.03, 5.11,   'a2',   '坦诚'],
        [20.99, 3.53,   'a3',   '利他性'],
        [15.33, 4.64,   'a4',   '顺从性'],
        [16.67, 4.06,   'a5',   '谦虚'],
        [19.91, 3.59,   'a6',   '温存'],
        [20.8,  4.34,   'c1',   '胜任感'],
        [18.39, 4.21,   'c2',   '条理性'],
        [23.47, 4.22,   'c3',   '责任心'],
        [20.02, 4.34,   'c4',   '事业心'],
        [20.48, 4.66,   'c5',   '自律性'],
        [20.72, 4.63,   'c6',   '审慎性'],
    ]
# 女性
norm_w = [
        #[平均分,       标准差, 维度代码,        维度]
        [87.26, 24.57,  'n',    '敏感性'],
        [106.14,        18.85,  'e',    '外向性'],
        [109.31,        17.26,  'o',    '开放性'],
        [119,   15.79,  'a',    '宜人性'],
        [125.07,        17.67,  'c',    '严谨性'],
        [14.81, 5.45,   'n1',   '焦虑'],
        [13.99, 5.16,   'n2',   '愤怒敌意'],
        [14.46, 5.45,   'n3',   '抑郁'],
        [16.38, 5.27,   'n4',   '自我意识'],
        [14.89, 5.1,    'n5',   '冲动性'],
        [12.73, 5.18,   'n6',   '脆弱性'],
        [22.05, 4.31,   'e1',   '热情性'],
        [18.3,  4.85,   'e2',   '乐群性'],
        [14.59, 4.67,   'e3',   '自我肯定'],
        [18.01, 4.93,   'e4',   '活跃性'],
        [14.25, 5.35,   'e5',   '刺激追寻'],
        [18.94, 5.09,   'e6',   '正性情绪'],
        [15.89, 4.78,   'o1',   '幻想'],
        [20.45, 4.78,   'o2',   '美感'],
        [19.59, 4.32,   'o3',   '情感'],
        [15.02, 3.88,   'o4',   '行动'],
        [17.68, 5.33,   'o5',   '观念'],
        [20.68, 3.76,   'o6',   '价值'],
        [21.84, 4.43,   'a1',   '信任'],
        [21.54, 4.97,   'a2',   '坦诚'],
        [21.19, 3.88,   'a3',   '利他性'],
        [16.19, 4.72,   'a4',   '顺从性'],
        [17.68, 4.62,   'a5',   '谦虚'],
        [20.56, 3.76,   'a6',   '温存'],
        [20.44, 4.33,   'c1',   '胜任感'],
        [19.32, 4.75,   'c2',   '条理性'],
        [24.18, 3.48,   'c3',   '责任心'],
        [19.69, 4.07,   'c4',   '事业心'],
        [21.01, 4.03,   'c5',   '自律性'],
        [20.43, 4.66,   'c6',   '审慎性'],
    ]

## 归一化得分计算方法与结果输出：
def calc_norm(x,m,sd,describe): 
    # debug
    #print("x={}\tm={}\tsd={}".format(x,m,sd))
    # end debug

    # 参数含义：
    #   x     未归一化的原始计分
    #   m     常模参数中的均值
    #   sd    常模参数中的标准差
    #   describe  对这一维度的文字描述
    # 本函数直接打印结果，不设返回值，因此尽可能在describe参数中详细说明这一维度的含义
    z = (x-m)/sd
    if(z<0): score = np.ceil(2*z+5)
    else:    score = np.ceil(10*z/3+5)
    if(score<1):  score=1
    if(score>10): score=10
    if(score<4):
        print("[Low]\t{}\t{}".format(score,describe))
    elif(score<7):
        print("[Mid]\t{}\t{}".format(score,describe))
    else:
        print("[High]\t{}\t{}".format(score,describe))
    return score



def calc_dim(mx,gender): 
    # parameters:
    #   mx      各维度计分结果。维度顺序是[N,E,O,A,C]
    #   gender  性别参数
    #           "m"-男性
    #           "w"-女性
    if(gender=="m"): norm = norm_m
    else:            norm = norm_w
    
    dims = ["N","E","O","A","C"]

    # 各维度计分
    for dim in range(5):
        print("\n\n{} - 维度计分".format(dims[dim]))
        data  = mx[dim]
        index = dim
        print("总分统计")
        calc_norm(np.sum(data),norm[index][0],norm[index][1],norm[index][2]+"\t"+norm[index][3])
        print("各分项统计")
        for i in range(6):
            idx = 5+index*6+i # index in norm parameter table
            calc_norm(data[i],norm[idx][0],norm[idx][1],norm[idx][2]+"\t"+norm[idx][3])

if(__name__=="__main__"):
    if(len(sys.argv)>1): infname = sys.argv[1]
    else:                infname = "大五人格（OCEAN）测试结果.txt"
    inf    = open(infname,'r')
    gender = "m" #在此定义性别
    # 文件格式定义：tsv格式，无空行，按照题号顺序一行存储一题的自测评分
    s = [0] # 注意，s的下标是题号，然而题号没有0，因此在index为0的地方需要占位
    for line in inf:
        a = line.strip().split("\t")
        s.append(int(a[0]))
    print("len of s=",len(s))
    mx = pre_calc(s) # return [N,E,O,A,C]
    #print(mx) #debug
    calc_dim(mx,gender)


